src/k-bench-results/k0s/reliability-control/reliability-control-3/memtier.out
4         Threads
50        Connections per thread
600       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         1582.51          ---          ---        11.47522        10.43100        24.83100        44.54300       121.91 
Gets        15823.42         6.33     15817.09        11.48008        10.36700        24.95900        45.05500       616.58 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      17405.94         6.33     15817.09        11.47964        10.36700        24.83100        45.05500       738.48 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.623        0.000
SET       8.895        5.000
SET       9.279       10.000
SET       9.471       15.000
SET       9.599       20.000
SET       9.727       25.000
SET       9.855       30.000
SET       9.983       35.000
SET      10.111       40.000
SET      10.239       45.000
SET      10.431       50.000
SET      10.495       52.500
SET      10.559       55.000
SET      10.623       57.500
SET      10.687       60.000
SET      10.751       62.500
SET      10.815       65.000
SET      10.943       67.500
SET      11.007       70.000
SET      11.135       72.500
SET      11.263       75.000
SET      11.327       76.250
SET      11.455       77.500
SET      11.519       78.750
SET      11.711       80.000
SET      11.839       81.250
SET      12.095       82.500
SET      12.415       83.750
SET      12.799       85.000
SET      13.247       86.250
SET      13.887       87.500
SET      14.271       88.125
SET      14.783       88.750
SET      15.615       89.375
SET      16.639       90.000
SET      17.535       90.625
SET      18.175       91.250
SET      18.559       91.875
SET      18.943       92.500
SET      19.199       93.125
SET      19.583       93.750
SET      19.711       94.062
SET      19.839       94.375
SET      19.967       94.688
SET      20.095       95.000
SET      20.351       95.312
SET      20.479       95.625
SET      20.735       95.938
SET      20.863       96.250
SET      21.119       96.562
SET      21.247       96.875
SET      21.375       97.031
SET      21.503       97.188
SET      21.631       97.344
SET      21.759       97.500
SET      21.887       97.656
SET      22.015       97.812
SET      22.143       97.969
SET      22.399       98.125
SET      22.527       98.281
SET      22.783       98.438
SET      22.911       98.516
SET      23.039       98.594
SET      23.295       98.672
SET      23.551       98.750
SET      23.807       98.828
SET      24.319       98.906
SET      24.703       98.984
SET      25.215       99.062
SET      25.855       99.141
SET      26.623       99.219
SET      27.007       99.258
SET      27.519       99.297
SET      28.031       99.336
SET      28.543       99.375
SET      29.055       99.414
SET      29.695       99.453
SET      30.463       99.492
SET      31.231       99.531
SET      32.255       99.570
SET      33.279       99.609
SET      34.047       99.629
SET      34.559       99.648
SET      35.071       99.668
SET      35.583       99.688
SET      36.351       99.707
SET      37.119       99.727
SET      37.631       99.746
SET      38.399       99.766
SET      39.167       99.785
SET      39.935       99.805
SET      40.447       99.814
SET      40.959       99.824
SET      41.471       99.834
SET      41.983       99.844
SET      42.239       99.854
SET      42.751       99.863
SET      43.263       99.873
SET      43.775       99.883
SET      44.287       99.893
SET      44.799       99.902
SET      45.311       99.907
SET      45.567       99.912
SET      46.079       99.917
SET      46.335       99.922
SET      46.847       99.927
SET      47.615       99.932
SET      47.871       99.937
SET      48.383       99.941
SET      48.895       99.946
SET      49.407       99.951
SET      49.663       99.954
SET      50.175       99.956
SET      50.431       99.958
SET      50.943       99.961
SET      51.199       99.963
SET      51.711       99.966
SET      51.967       99.968
SET      52.735       99.971
SET      53.247       99.973
SET      53.759       99.976
SET      54.015       99.977
SET      54.527       99.978
SET      54.783       99.979
SET      55.039       99.980
SET      55.551       99.982
SET      56.575       99.983
SET      57.087       99.984
SET      57.599       99.985
SET      57.855       99.987
SET      58.367       99.988
SET      58.879       99.988
SET      59.135       99.989
SET      59.647       99.990
SET      60.415       99.990
SET      61.183       99.991
SET      61.695       99.991
SET      62.463       99.992
SET      63.743       99.993
SET      64.511       99.993
SET      65.535       99.994
SET      66.047       99.994
SET      66.559       99.995
SET      67.071       99.995
SET      67.583       99.995
SET      68.095       99.995
SET      70.143       99.996
SET      71.679       99.996
SET      72.191       99.996
SET      73.727       99.997
SET      74.239       99.997
SET      74.751       99.997
SET      74.751       99.997
SET      76.287       99.997
SET      76.287       99.998
SET      76.799       99.998
SET      76.799       99.998
SET      77.823       99.998
SET      78.847       99.998
SET      79.359       99.998
SET      79.871       99.998
SET      79.871       99.999
SET      79.871       99.999
SET      80.383       99.999
SET      80.895       99.999
SET      81.919       99.999
SET      81.919       99.999
SET      81.919       99.999
SET      86.015       99.999
SET      88.575       99.999
SET      88.575       99.999
SET      89.087       99.999
SET      89.087       99.999
SET      89.087       99.999
SET      90.111       99.999
SET      90.111       99.999
SET      90.111       99.999
SET      90.623      100.000
SET      90.623      100.000
SET      90.623      100.000
[...]
SET      92.159      100.000
SET      92.159      100.000
SET      92.159      100.000
[...]
SET      92.671      100.000
SET      92.671      100.000
SET      92.671      100.000
[...]
SET     120.831      100.000
SET     120.831      100.000
---
GET       1.335        0.000
GET       8.895        5.000
GET       9.279       10.000
GET       9.471       15.000
GET       9.599       20.000
GET       9.727       25.000
GET       9.855       30.000
GET       9.983       35.000
GET      10.111       40.000
GET      10.239       45.000
GET      10.367       50.000
GET      10.495       52.500
GET      10.559       55.000
GET      10.623       57.500
GET      10.687       60.000
GET      10.751       62.500
GET      10.815       65.000
GET      10.943       67.500
GET      11.007       70.000
GET      11.135       72.500
GET      11.263       75.000
GET      11.327       76.250
GET      11.455       77.500
GET      11.519       78.750
GET      11.711       80.000
GET      11.839       81.250
GET      12.095       82.500
GET      12.415       83.750
GET      12.799       85.000
GET      13.311       86.250
GET      13.887       87.500
GET      14.271       88.125
GET      14.847       88.750
GET      15.679       89.375
GET      16.767       90.000
GET      17.663       90.625
GET      18.175       91.250
GET      18.559       91.875
GET      18.943       92.500
GET      19.199       93.125
GET      19.583       93.750
GET      19.711       94.062
GET      19.839       94.375
GET      19.967       94.688
GET      20.223       95.000
GET      20.351       95.312
GET      20.479       95.625
GET      20.735       95.938
GET      20.863       96.250
GET      21.119       96.562
GET      21.247       96.875
GET      21.375       97.031
GET      21.503       97.188
GET      21.631       97.344
GET      21.759       97.500
GET      21.887       97.656
GET      22.015       97.812
GET      22.143       97.969
GET      22.399       98.125
GET      22.527       98.281
GET      22.783       98.438
GET      22.911       98.516
GET      23.167       98.594
GET      23.295       98.672
GET      23.551       98.750
GET      23.935       98.828
GET      24.319       98.906
GET      24.831       98.984
GET      25.343       99.062
GET      25.983       99.141
GET      26.751       99.219
GET      27.263       99.258
GET      27.775       99.297
GET      28.287       99.336
GET      28.799       99.375
GET      29.311       99.414
GET      30.079       99.453
GET      30.847       99.492
GET      31.743       99.531
GET      32.767       99.570
GET      33.791       99.609
GET      34.303       99.629
GET      35.071       99.648
GET      35.583       99.668
GET      36.095       99.688
GET      36.863       99.707
GET      37.375       99.727
GET      38.143       99.746
GET      38.911       99.766
GET      39.679       99.785
GET      40.447       99.805
GET      40.703       99.814
GET      41.215       99.824
GET      41.727       99.834
GET      42.239       99.844
GET      42.495       99.854
GET      43.007       99.863
GET      43.519       99.873
GET      44.031       99.883
GET      44.543       99.893
GET      45.055       99.902
GET      45.567       99.907
GET      45.823       99.912
GET      46.335       99.917
GET      46.591       99.922
GET      47.103       99.927
GET      47.359       99.932
GET      47.871       99.937
GET      48.383       99.941
GET      48.895       99.946
GET      49.663       99.951
GET      49.919       99.954
GET      50.175       99.956
GET      50.687       99.958
GET      50.943       99.961
GET      51.455       99.963
GET      51.967       99.966
GET      52.223       99.968
GET      52.735       99.971
GET      53.503       99.973
GET      54.015       99.976
GET      54.271       99.977
GET      54.783       99.978
GET      55.295       99.979
GET      55.551       99.980
GET      56.063       99.982
GET      56.575       99.983
GET      57.343       99.984
GET      57.855       99.985
GET      58.367       99.987
GET      58.879       99.988
GET      59.135       99.988
GET      59.647       99.989
GET      59.903       99.990
GET      60.671       99.990
GET      61.183       99.991
GET      61.695       99.991
GET      62.463       99.992
GET      63.487       99.993
GET      64.767       99.993
GET      66.047       99.994
GET      66.559       99.994
GET      67.071       99.995
GET      67.583       99.995
GET      68.095       99.995
GET      69.119       99.995
GET      69.631       99.996
GET      70.655       99.996
GET      72.191       99.996
GET      73.215       99.997
GET      74.239       99.997
GET      75.263       99.997
GET      75.775       99.997
GET      76.287       99.997
GET      76.799       99.998
GET      77.823       99.998
GET      78.847       99.998
GET      79.871       99.998
GET      81.407       99.998
GET      82.431       99.998
GET      83.967       99.998
GET      85.503       99.999
GET      86.015       99.999
GET      87.039       99.999
GET      88.063       99.999
GET      89.087       99.999
GET      89.599       99.999
GET      90.623       99.999
GET      91.135       99.999
GET      92.159       99.999
GET      93.183       99.999
GET      93.695       99.999
GET      94.207       99.999
GET      94.719       99.999
GET      96.255       99.999
GET      97.279       99.999
GET      98.303       99.999
GET      99.327      100.000
GET     100.351      100.000
GET     100.351      100.000
GET     101.375      100.000
GET     101.375      100.000
GET     101.887      100.000
GET     102.399      100.000
GET     103.423      100.000
GET     103.423      100.000
GET     103.935      100.000
GET     106.495      100.000
GET     107.007      100.000
GET     107.519      100.000
GET     107.519      100.000
GET     108.031      100.000
GET     108.543      100.000
GET     109.055      100.000
GET     109.567      100.000
GET     111.615      100.000
GET     113.151      100.000
GET     114.175      100.000
GET     117.247      100.000
GET     117.759      100.000
GET     117.759      100.000
GET     118.271      100.000
GET     118.271      100.000
GET     119.295      100.000
GET     119.295      100.000
GET     119.295      100.000
[...]
GET     119.807      100.000
GET     119.807      100.000
GET     120.319      100.000
GET     120.319      100.000
GET     120.319      100.000
[...]
GET     120.831      100.000
GET     120.831      100.000
GET     120.831      100.000
[...]
GET     130.047      100.000
GET     130.047      100.000
GET     130.047      100.000
[...]
GET     133.119      100.000
GET     133.119      100.000
---
WAIT      0.000      100.000